tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "teamookla/speedtest"
brew "aria2"
brew "arp-scan"
brew "bash"
brew "bash-completion", link: false
brew "bash-completion@2"
brew "bat"
brew "btop"
brew "cmatrix"
brew "coreutils"
brew "cpufetch"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "git"
brew "gnupg"
brew "hexyl"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "m-cli"
brew "moreutils"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "node"
brew "numbat"
brew "onefetch"
brew "openssh"
brew "openvpn"
brew "pfetch"
brew "php"
brew "pv"
brew "rclone"
brew "rmlint"
brew "rust"
brew "starship"
brew "stow"
brew "tlrc"
brew "tmux"
brew "tree"
brew "vnstat"
brew "wget"
cask "alt-tab"
cask "chatgpt"
cask "copyq"
cask "flameshot"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-hack-nerd-font"
cask "geekbench"
cask "hiddenbar"
cask "iterm2"
cask "linearmouse"
cask "mac-mouse-fix"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "smcfancontrol"
cask "stats"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whisky"
vscode "abusaidm.html-snippets"
vscode "akamud.vscode-theme-onedark"
vscode "alexcvzz.vscode-sqlite"
vscode "anseki.vscode-color"
vscode "austin.code-gnu-global"
vscode "batisteo.vscode-django"
vscode "bierner.color-info"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eg2.vscode-npm-script"
vscode "eliverlara.andromeda"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.vscode-mysql"
vscode "franneck94.c-cpp-runner"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "henoc.svgeditor"
vscode "hookyqr.beautify"
vscode "htmlhint.vscode-htmlhint"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "kevinrose.vsc-python-indent"
vscode "lihui.vs-color-picker"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "tauri-apps.tauri-vscode"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
